FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_GPIO.c
    // Output mode is set by putting 1's in the IODIR register
    (*p_info->iIODIR) |= aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPIO_SetInputMode
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be input mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be input mode
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPIO_SetInputMode(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;
    const LPC1788_GPIO_PortInfo *p_info = p->iPortInfo;

    // Input mode is set by putting 0's in the IODIR register
    // Make those bits 0
    (*p_info->iIODIR) &= ~aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPIO_Set
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output HIGH.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output HIGH
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPIO_Set(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;
    const LPC1788_GPIO_PortInfo *p_info = p->iPortInfo;

    // Set the bits corresponding to those pins
    (*p_info->iIOSET) = aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPIO_Clear
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output LOW.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output HIGH
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPIO_Clear(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;
    const LPC1788_GPIO_PortInfo *p_info = p->iPortInfo;

    // Set the bits corresponding to those pins
    (*p_info->iIOCLR) = aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPIO_Read
 *---------------------------------------------------------------------------*
 * Description:
 *      Read a group of GPIO pins.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output HIGH
 *      TUInt32 *aPinsRead          -- Pointer to pins result.
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPIO_Read(
        void *aWorkspace,
        TUInt32 aPortPins,
        TUInt32 *aPinsRead)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;
    const LPC1788_GPIO_PortInfo *p_info = p->iPortInfo;

    // Get the bits
    *aPinsRead = ((*p_info->iIOPIN) & aPortPins);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPIO_SetPull
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-31
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPIO_SetPull(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioPull aPull)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;
    const LPC1788_GPIO_PortInfo *p_info = p->iPortInfo;
    TVUInt32 *p_iocon;
    TUInt32 mode;

    // Indexes only
    if (aPortPinIndex >= 32)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Look up the IOCON register
    p_iocon = p_info->iIOCONTable[aPortPinIndex];
    if (!p_iocon)
        return UEZ_ERROR_NOT_SUPPORTED;

    // Map to a bit field
    switch (aPull) {
        case GPIO_PULL_UP:
            mode = 2 << 3;
            break;
        case GPIO_PULL_NONE:
            mode = 0 << 3;
            break;
        case GPIO_PULL_DOWN:
            mode = 1 << 3;
            break;
        case GPIO_REPEATER:
            mode = 3 << 3;
            break;
        default:
            return UEZ_ERROR_NOT_SUPPORTED;
#if (COMPILER_TYPE != IAR)
            break;
#endif
    }

    /* Change bits 4:3 MODE of the IOCON register */
    *p_iocon = (*p_iocon & ~(3 << 3)) | mode;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPIO_SetMux
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pin's mux feature.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-31
 *      T_gpioMux aMux              -- Mux setting to use
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPIO_SetMux(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioMux aMux)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;
    const LPC1788_GPIO_PortInfo *p_info = p->iPortInfo;
    TVUInt32 *p_iocon;

