FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_GPIO.c
    if (aPortPinIndex >= 32)
        return UEZ_ERROR_INVALID_PARAMETER;
    if (aMux >= 8)
        return UEZ_ERROR_OUT_OF_RANGE;

    p_iocon = p_info->iIOCONTable[aPortPinIndex];
    if (!p_iocon)
        return UEZ_ERROR_NOT_SUPPORTED;

    /* Change bits 2:0 FUNC */
    *p_iocon = (*p_iocon & ~(7 << 0)) | aMux;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPIO_GetMux
 *---------------------------------------------------------------------------*
 * Description:
 *      Get pin's mux feature.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-31
 *      T_gpioMux aMux              -- Mux setting being used
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPIO_GetMux(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioMux *aMux)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;
    const LPC1788_GPIO_PortInfo *p_info = p->iPortInfo;
    TVUInt32 *p_iocon;

    if (aPortPinIndex >= 32)
        return UEZ_ERROR_INVALID_PARAMETER;

    p_iocon = p_info->iIOCONTable[aPortPinIndex];
    if (!p_iocon)
        return UEZ_ERROR_NOT_SUPPORTED;

    /* Get bits 2:0 FUNC */
    *aMux = (*p_iocon & (7 << 0));

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Interrupt Routine:  LPC1788_GPIO_IRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      One of the GPIO interrupts have fired off, do the right one.
 * NOTES:
 *      This routine is inside an interrupt!
 *---------------------------------------------------------------------------*/
static IRQ_ROUTINE(LPC1788_GPIO_IRQ)
{
#define IOIntStatus_P0Int       (1<<0)
#define IOIntStatus_P2Int       (1<<2)

    IRQ_START();

    // It's port 0 and/or port 2, is this port 0 firing?
    if (LPC_GPIOINT->IntStatus & IOIntStatus_P0Int)
        LPC1788_GPIO_ProcessIRQ(G_LPC1788Port0Workspace);
    if (LPC_GPIOINT->IntStatus & IOIntStatus_P2Int)
        LPC1788_GPIO_ProcessIRQ(G_LPC1788Port2Workspace);

    IRQ_END()
    ;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPIO_SetInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the GPIO's interrupt mode (enable if not already enabled)
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      T_gpioInterruptHandler iInterruptCallback -- Routine to call on
 *                                      interrupt.
 *      void *iInterruptCallbackWorkspace -- Workspace of callback
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPIO_ConfigureInterruptCallback(
        void *aWorkspace,
        T_gpioInterruptHandler aInterruptCallback,
        void *aInterruptCallbackWorkspace)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;

    // Register the interrupt handler if not already registered
    InterruptRegister(GPIO_IRQn, LPC1788_GPIO_IRQ, INTERRUPT_PRIORITY_HIGH,
            "GPIOIrq");
    InterruptEnable(GPIO_IRQn);

    p->iInterruptCallback = aInterruptCallback;
    p->iInterruptCallbackWorkspace = aInterruptCallbackWorkspace;

    return UEZ_ERROR_NONE;
}

T_uezError LPC1788_GPIO_ConfigureInterruptCallback_NotSupported(
        void *aWorkspace,
        T_gpioInterruptHandler aInterruptCallback,
        void *aInterruptCallbackWorkspace)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aInterruptCallback);PARAM_NOT_USED(aInterruptCallbackWorkspace);

    // No IRQs on these
    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPIO_ProcessIRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      One of the GPIO ports is reporting an IRQ.  This processes one
 *      of the ports for falling or rising edge events.
 * NOTES:
 *      This routine is inside an interrupt!
 *---------------------------------------------------------------------------*/
void LPC1788_GPIO_ProcessIRQ(T_LPC1788_GPIO_Workspace *p)
{
    TUInt32 regF;
    TUInt32 regR;
    const LPC1788_GPIO_PortInfo *p_info = p->iPortInfo;

    // Make sure we have a handler
    if (!p->iInterruptCallback)
        InterruptFatalError();

    // Do we have any falling edge interrupts?
    regF = *(p_info->iIOIntStatF);
    regR = *(p_info->iIOIntStatR);
    if (regF)
        p->iInterruptCallback(p->iInterruptCallbackWorkspace, regF,
                GPIO_INTERRUPT_FALLING_EDGE);

    // Do we have any rising edge interrupts?
    if (regR)
        p->iInterruptCallback(p->iInterruptCallbackWorkspace, regR,
                GPIO_INTERRUPT_RISING_EDGE);

    // Now clear all the interrupts processed above
    // (regardless of enabled/disabled state)
    *(p_info->iIOIntClr) = regF | regR;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPIO_EnableInterrupts
 *---------------------------------------------------------------------------*
 * Description:
 *      Turn on the interrupts for the given type of one or more port pins.
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Masked list of ports to enable.
 *      T_gpioInterruptType aType   -- Type of interrupts to enable.
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPIO_EnableInterrupts(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;
    const LPC1788_GPIO_PortInfo *p_info = p->iPortInfo;

    if (aType == GPIO_INTERRUPT_FALLING_EDGE)
        (*p_info->iIOIntEnF) |= aPortPins;
    else if (aType == GPIO_INTERRUPT_RISING_EDGE)
        (*p_info->iIOIntEnR) |= aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPIO_DisableInterrupts
 *---------------------------------------------------------------------------*
 * Description:
 *      Turn off the interrupts for the given type of one or more port pins.
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Masked list of ports to disable.
 *      T_gpioInterruptType aType   -- Type of interrupts to disable.
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPIO_DisableInterrupts(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;
    const LPC1788_GPIO_PortInfo *p_info = p->iPortInfo;

    if (aType == GPIO_INTERRUPT_FALLING_EDGE)
        (*p_info->iIOIntEnF) &= ~aPortPins;
    else if (aType == GPIO_INTERRUPT_RISING_EDGE)
        (*p_info->iIOIntEnR) &= ~aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_GPIO_ClearInterrupts
 *---------------------------------------------------------------------------*
 * Description:
 *      Clear interrupts on a specific GPIO line
 * Inputs:
 *      void *aWorkspace            -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Masked list of ports to disable.
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_GPIO_ClearInterrupts(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;
    const LPC1788_GPIO_PortInfo *p_info = p->iPortInfo;

    (*p_info->iIOIntClr) = aPortPins;

    return UEZ_ERROR_NONE;
}

