FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_GPIO.c
T_uezError LPC1788_GPIO_EnableInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aPortPins);PARAM_NOT_USED(aType);
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError LPC1788_GPIO_DisableInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins,
        T_gpioInterruptType aType)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aPortPins);PARAM_NOT_USED(aType);
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError LPC1788_GPIO_ClearInterrupts_NotSupported(
        void *aWorkspace,
        TUInt32 aPortPins)
{
    PARAM_NOT_USED(aWorkspace);PARAM_NOT_USED(aPortPins);
    return UEZ_ERROR_NOT_SUPPORTED;
}

T_uezError LPC1788_GPIO_Control(
        void *aWorkspace,
        TUInt8 aPortPinIndex,
        T_gpioControl aControl,
        TUInt32 aValue)
{
    TVUInt32 *p_iocon;
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;
    const LPC1788_GPIO_PortInfo *p_info = p->iPortInfo;

    PARAM_NOT_USED(aValue);

    // Look up the IOCON register
    p_iocon = p_info->iIOCONTable[aPortPinIndex];
    if (!p_iocon)
        return UEZ_ERROR_NOT_SUPPORTED;

    switch (aControl) {
        case GPIO_NOP:
            // Yep, do no operation
            break;
        case GPIO_CONTROL_ENABLE_INPUT_BUFFER:
            *p_iocon |= (1 << 7);
            break;
        case GPIO_CONTROL_DISABLE_INPUT_BUFFER:
            *p_iocon &= ~(1 << 7);
            break;
        case GPIO_CONTROL_SET_CONFIG_BITS:
            *p_iocon = aValue;
            break;
        default:
            return UEZ_ERROR_NOT_SUPPORTED;
#if (COMPILER_TYPE != IAR)
            break;
#endif
    }

    return UEZ_ERROR_NONE;
}

T_uezError LPC1788_GPIO_Lock(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;
    // Any pins already locked?
    if (p->iLocked & aPortPins) {
        UEZFailureMsg("PinLock");
        return UEZ_ERROR_NOT_AVAILABLE;
    }
    p->iLocked |= aPortPins;
    return UEZ_ERROR_NONE;
}

T_uezError LPC1788_GPIO_Unlock(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC1788_GPIO_Workspace *p = (T_LPC1788_GPIO_Workspace *)aWorkspace;

    p->iLocked &= ~aPortPins;
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * HAL Interface tables:
 *---------------------------------------------------------------------------*/
const HAL_GPIOPort GPIO_LPC1788_Port0_Interface = {
        {
        "LPC1788 GPIO Port 0",
        0x0106,
        LPC1788_GPIO_Port0_InitializeWorkspace,
        sizeof(T_LPC1788_GPIO_Workspace),
        },

        LPC1788_GPIO_Configure,
        LPC1788_GPIO_Activate,
        LPC1788_GPIO_Deactivate,
        LPC1788_GPIO_SetOutputMode,
        LPC1788_GPIO_SetInputMode,
        LPC1788_GPIO_Set,
        LPC1788_GPIO_Clear,
        LPC1788_GPIO_Read,
        LPC1788_GPIO_SetPull,
        LPC1788_GPIO_SetMux,
        LPC1788_GPIO_ConfigureInterruptCallback,
        LPC1788_GPIO_EnableInterrupts,
        LPC1788_GPIO_DisableInterrupts,
        LPC1788_GPIO_ClearInterrupts,
        LPC1788_GPIO_Control,
        LPC1788_GPIO_Lock,
        LPC1788_GPIO_Unlock,
        LPC1788_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC1788_Port1_Interface = {
        {
        "LPC1788 GPIO Port 1",
        0x0106,
        LPC1788_GPIO_Port1_InitializeWorkspace,
        sizeof(T_LPC1788_GPIO_Workspace),
        },

        LPC1788_GPIO_Configure,
        LPC1788_GPIO_Activate,
        LPC1788_GPIO_Deactivate,
        LPC1788_GPIO_SetOutputMode,
        LPC1788_GPIO_SetInputMode,
        LPC1788_GPIO_Set,
        LPC1788_GPIO_Clear,
        LPC1788_GPIO_Read,
        LPC1788_GPIO_SetPull,
        LPC1788_GPIO_SetMux,
        LPC1788_GPIO_ConfigureInterruptCallback_NotSupported,
        LPC1788_GPIO_EnableInterrupts_NotSupported,
        LPC1788_GPIO_DisableInterrupts_NotSupported,
        LPC1788_GPIO_ClearInterrupts_NotSupported,
        LPC1788_GPIO_Control,
        LPC1788_GPIO_Lock,
        LPC1788_GPIO_Unlock,
        LPC1788_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC1788_Port2_Interface = {
        {
        "LPC1788 GPIO Port 2",
        0x0106,
        LPC1788_GPIO_Port2_InitializeWorkspace,
        sizeof(T_LPC1788_GPIO_Workspace),
        },

        LPC1788_GPIO_Configure,
        LPC1788_GPIO_Activate,
        LPC1788_GPIO_Deactivate,
        LPC1788_GPIO_SetOutputMode,
        LPC1788_GPIO_SetInputMode,
        LPC1788_GPIO_Set,
        LPC1788_GPIO_Clear,
        LPC1788_GPIO_Read,
        LPC1788_GPIO_SetPull,
        LPC1788_GPIO_SetMux,
        LPC1788_GPIO_ConfigureInterruptCallback,
        LPC1788_GPIO_EnableInterrupts,
        LPC1788_GPIO_DisableInterrupts,
        LPC1788_GPIO_ClearInterrupts,
        LPC1788_GPIO_Control,
        LPC1788_GPIO_Lock,
        LPC1788_GPIO_Unlock,
        LPC1788_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC1788_Port3_Interface = {
        {
        "LPC1788 GPIO Port 3",
        0x0106,
        LPC1788_GPIO_Port3_InitializeWorkspace,
        sizeof(T_LPC1788_GPIO_Workspace),
        },

        LPC1788_GPIO_Configure,
        LPC1788_GPIO_Activate,
        LPC1788_GPIO_Deactivate,
        LPC1788_GPIO_SetOutputMode,
        LPC1788_GPIO_SetInputMode,
        LPC1788_GPIO_Set,
        LPC1788_GPIO_Clear,
        LPC1788_GPIO_Read,
        LPC1788_GPIO_SetPull,
        LPC1788_GPIO_SetMux,
        LPC1788_GPIO_ConfigureInterruptCallback_NotSupported,
        LPC1788_GPIO_EnableInterrupts_NotSupported,
        LPC1788_GPIO_DisableInterrupts_NotSupported,
        LPC1788_GPIO_ClearInterrupts_NotSupported,
        LPC1788_GPIO_Control,
        LPC1788_GPIO_Lock,
        LPC1788_GPIO_Unlock,
        LPC1788_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC1788_Port4_Interface = {
        {
        "LPC1788 GPIO Port 4",
        0x0106,
        LPC1788_GPIO_Port4_InitializeWorkspace,
        sizeof(T_LPC1788_GPIO_Workspace),
        },

        LPC1788_GPIO_Configure,
        LPC1788_GPIO_Activate,
        LPC1788_GPIO_Deactivate,
        LPC1788_GPIO_SetOutputMode,
        LPC1788_GPIO_SetInputMode,
        LPC1788_GPIO_Set,
        LPC1788_GPIO_Clear,
        LPC1788_GPIO_Read,
        LPC1788_GPIO_SetPull,
        LPC1788_GPIO_SetMux,
        LPC1788_GPIO_ConfigureInterruptCallback_NotSupported,
        LPC1788_GPIO_EnableInterrupts_NotSupported,
        LPC1788_GPIO_DisableInterrupts_NotSupported,
        LPC1788_GPIO_ClearInterrupts_NotSupported,
        LPC1788_GPIO_Control,
        LPC1788_GPIO_Lock,
        LPC1788_GPIO_Unlock,
        LPC1788_GPIO_GetMux };

const HAL_GPIOPort GPIO_LPC1788_Port5_Interface = {
        {
        "LPC1788 GPIO Port 5",
        0x0106,
        LPC1788_GPIO_Port5_InitializeWorkspace,
        sizeof(T_LPC1788_GPIO_Workspace),
        },

        LPC1788_GPIO_Configure,
        LPC1788_GPIO_Activate,
        LPC1788_GPIO_Deactivate,
        LPC1788_GPIO_SetOutputMode,
        LPC1788_GPIO_SetInputMode,
        LPC1788_GPIO_Set,
        LPC1788_GPIO_Clear,
        LPC1788_GPIO_Read,
        LPC1788_GPIO_SetPull,
        LPC1788_GPIO_SetMux,
        LPC1788_GPIO_ConfigureInterruptCallback_NotSupported,
        LPC1788_GPIO_EnableInterrupts_NotSupported,
        LPC1788_GPIO_DisableInterrupts_NotSupported,
        LPC1788_GPIO_ClearInterrupts_NotSupported,
        LPC1788_GPIO_Control,
        LPC1788_GPIO_Lock,
        LPC1788_GPIO_Unlock,
        LPC1788_GPIO_GetMux };

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1788_GPIO0_Require(void)
{
    HAL_GPIOPort **p_gpio0;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO0 and allow all pins
    HALInterfaceRegister("GPIO0",
            (T_halInterface *)&GPIO_LPC1788_Port0_Interface, 0,
            (T_halWorkspace **)&p_gpio0);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_0, p_gpio0);
}

void LPC1788_GPIO1_Require(void)
{
    HAL_GPIOPort **p_gpio1;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO1 and allow all pins
    HALInterfaceRegister("GPIO1",
            (T_halInterface *)&GPIO_LPC1788_Port1_Interface, 0,
            (T_halWorkspace **)&p_gpio1);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_1, p_gpio1);
}

void LPC1788_GPIO2_Require(void)
{
    HAL_GPIOPort **p_gpio2;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO2 and allow all pins
    HALInterfaceRegister("GPIO2",
            (T_halInterface *)&GPIO_LPC1788_Port2_Interface, 0,
            (T_halWorkspace **)&p_gpio2);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_2, p_gpio2);
}

void LPC1788_GPIO3_Require(void)
{
    HAL_GPIOPort **p_gpio3;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO3 and allow all pins
    HALInterfaceRegister("GPIO3",
            (T_halInterface *)&GPIO_LPC1788_Port3_Interface, 0,
            (T_halWorkspace **)&p_gpio3);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_3, p_gpio3);
}

void LPC1788_GPIO4_Require(void)
{
    HAL_GPIOPort **p_gpio4;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO4 and allow all pins
    HALInterfaceRegister("GPIO4",
            (T_halInterface *)&GPIO_LPC1788_Port4_Interface, 0,
            (T_halWorkspace **)&p_gpio4);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_4, p_gpio4);
}

void LPC1788_GPIO5_Require(void)
{
    HAL_GPIOPort **p_gpio5;
    HAL_DEVICE_REQUIRE_ONCE();
    // Register GPIO5 and allow all pins
    HALInterfaceRegister("GPIO5",
            (T_halInterface *)&GPIO_LPC1788_Port5_Interface, 0,
            (T_halWorkspace **)&p_gpio5);
    UEZGPIORegisterPort(UEZ_GPIO_PORT_5, p_gpio5);
}

/*-------------------------------------------------------------------------*
 * End of File:  GPIO.c
 *-------------------------------------------------------------------------*/
